Revit 2016 API
Document.NewGrid Method
 Creates a new grid line.
Overload List
Name | Description
NewGrid(Arc) |  Obsolete.
 Creates a new radial grid line.
NewGrid(Line) |  Obsolete.
 Creates a new linear grid line.
See Also
Document Class
Document Members
Autodesk.Revit.Creation Namespace